# Wide & Deep

In [9]:
import pandas as pd

In [31]:
data = pd.read_csv('../dataset/ml-100k/data.csv')
data.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [32]:
user = pd.read_csv('../dataset/ml-100k/user.csv')
user.head()

   user_id  age gender  occupation zipcode
0        1   24      M  technician   85711
1        2   53      F       other   94043
2        3   23      M      writer   32067
3        4   24      M  technician   43537
4        5   33      F       other   15213

In [33]:
item = pd.read_csv('../dataset/ml-100k/item.csv')
item.head()

,movie_id,movie_title,release_date,video_release_date,IMDb_URL,unknown,Action,Adventure,Animation,Childrens,...,Fantasy,Film_Noir,Horror,Musical,Mystery,Romance,Sci_Fi,Thriller,War,Western
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [34]:
data
data['like'] = data["rating"].apply(lambda x: x>3.5).astype(int)
data

       user_id  item_id  rating  timestamp  like
0          196      242       3  881250949     0
1          186      302       3  891717742     0
2           22      377       1  878887116     0
3          244       51       2  880606923     0
4          166      346       1  886397596     0
...        ...      ...     ...        ...   ...
99995      880      476       3  880175444     0
99996      716      204       5  879795543     1
99997      276     1090       1  874795795     0
99998       13      225       2  882399156     0
99999       12      203       3  879959583     0

[100000 rows x 5 columns]

In [35]:
data

       user_id  item_id  rating  timestamp  like
0          196      242       3  881250949     0
1          186      302       3  891717742     0
2           22      377       1  878887116     0
3          244       51       2  880606923     0
4          166      346       1  886397596     0
...        ...      ...     ...        ...   ...
99995      880      476       3  880175444     0
99996      716      204       5  879795543     1
99997      276     1090       1  874795795     0
99998       13      225       2  882399156     0
99999       12      203       3  879959583     0

[100000 rows x 5 columns]

## add features

In [36]:
data = data.merge(user, on='user_id', how='left')
data = data.merge(item, left_on='item_id', right_on='movie_id', how='left')

In [37]:
data

,user_id,item_id,rating,timestamp,like,age,gender,occupation,zipcode,movie_id,...,Fantasy,Film_Noir,Horror,Musical,Mystery,Romance,Sci_Fi,Thriller,War,Western
0,196,242,3,881250949,0,49,M,writer,55105,242,...,0,0,0,0,0,0,0,0,0,0
1,186,302,3,891717742,0,39,F,executive,00000,302,...,0,1,0,0,1,0,0,1,0,0
2,22,377,1,878887116,0,25,M,writer,40206,377,...,0,0,0,0,0,0,0,0,0,0
3,244,51,2,880606923,0,28,M,technician,80525,51,...,0,0,0,0,0,1,0,0,1,1
4,166,346,1,886397596,0,47,M,educator,55113,346,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
99995,880,476,3,880175444,0,13,M,student,83702,476,...,0,0,0,0,0,0,0,0,0,0
99996,716,204,5,879795543,1,36,F,administrator,44265,204,...,0,0,0,0,0,0,1,0,0,0
99997,276,1090,1,874795795,0,21,M,student,95064,1090,...,0,0,0,0,0,0,0,1,0,0
99998,13,225,2,882399156,0,47,M,educator,29206,225,...,0,0,0,0,0,0,0,0,0,0
99999,12,203,3,879959583,0,28,F,other,06405,203,...,0,0,0,0,0,0,0,0,0,1

## data split

In [38]:
data_sorted = data.sort_values(by=['user_id', 'timestamp'], ascending=[True, False])

test_set = data_sorted.groupby('user_id').head(5)

test_indices = test_set.index

train_set = data_sorted.drop(index=test_indices)

In [39]:
train_set.head(5)

,user_id,item_id,rating,timestamp,like,age,gender,occupation,zipcode,movie_id,...,Fantasy,Film_Noir,Horror,Musical,Mystery,Romance,Sci_Fi,Thriller,War,Western
88259,1,111,5,889751711,1,24,M,technician,85711,111,...,0,0,0,0,0,1,0,0,0,0
10922,1,242,5,889751633,1,24,M,technician,85711,242,...,0,0,0,0,0,0,0,0,0,0
305,1,189,3,888732928,0,24,M,technician,85711,189,...,0,0,0,0,0,0,0,0,0,0
25255,1,32,5,888732909,1,24,M,technician,85711,32,...,0,0,0,0,0,0,0,0,0,0
8737,1,209,4,888732908,1,24,M,technician,85711,209,...,0,0,0,1,0,0,0,0,0,0

In [40]:
test_set.head(10)

,user_id,item_id,rating,timestamp,like,age,gender,occupation,zipcode,movie_id,...,Fantasy,Film_Noir,Horror,Musical,Mystery,Romance,Sci_Fi,Thriller,War,Western
3248,1,74,1,889751736,0,24,M,technician,85711,74,...,0,0,0,0,0,0,0,0,0,0
19699,1,102,2,889751736,0,24,M,technician,85711,102,...,0,0,0,0,0,0,0,0,0,0
30479,1,256,4,889751712,1,24,M,technician,85711,256,...,0,0,0,0,0,1,0,0,0,0
47638,1,5,3,889751712,0,24,M,technician,85711,5,...,0,0,0,0,0,0,0,1,0,0
687,1,171,5,889751711,1,24,M,technician,85711,171,...,0,0,0,0,0,0,1,0,0,0
7519,2,281,3,888980240,0,53,F,other,94043,281,...,0,0,0,0,0,0,0,1,0,0
3425,2,314,1,888980085,0,53,F,other,94043,314,...,0,0,0,0,0,0,0,0,0,0
36334,2,309,1,888980029,0,53,F,other,94043,309,...,0,0,0,0,0,0,0,0,0,0
9980,2,308,3,888979945,0,53,F,other,94043,308,...,1,0,0,0,0,0,0,0,0,0
12150,2,316,5,888979693,1,53,F,other,94043,316,...,0,0,0,0,0,0,0,0,0,0

In [43]:
train_set.shape

(95285, 33)

In [44]:
test_set.shape

(4715, 33)

In [46]:
train_set.to_csv('../dataset/ml-100k/train_test/train.csv', index=False)
test_set.to_csv('../dataset/ml-100k/train_test/test.csv', index=False)